Return-Path: <linux-pm+bounces-42556-lists+linux-pm=lfdr.de@vger.kernel.org>
Delivered-To: lists+linux-pm@lfdr.de
Received: from mail.lfdr.de
	by lfdr with LMTP
	id OBQxI5TGjWnT6gAAu9opvQ
	(envelope-from <linux-pm+bounces-42556-lists+linux-pm=lfdr.de@vger.kernel.org>)
	for <lists+linux-pm@lfdr.de>; Thu, 12 Feb 2026 13:24:52 +0100
X-Original-To: lists+linux-pm@lfdr.de
Received: from sea.lore.kernel.org (sea.lore.kernel.org [172.234.253.10])
	by mail.lfdr.de (Postfix) with ESMTPS id D22F512D6EC
	for <lists+linux-pm@lfdr.de>; Thu, 12 Feb 2026 13:24:51 +0100 (CET)
Received: from smtp.subspace.kernel.org (conduit.subspace.kernel.org [100.90.174.1])
	by sea.lore.kernel.org (Postfix) with ESMTP id 9C26B300F5D0
	for <lists+linux-pm@lfdr.de>; Thu, 12 Feb 2026 12:23:30 +0000 (UTC)
Received: from localhost.localdomain (localhost.localdomain [127.0.0.1])
	by smtp.subspace.kernel.org (Postfix) with ESMTP id C51323570B6;
	Thu, 12 Feb 2026 12:23:29 +0000 (UTC)
Authentication-Results: smtp.subspace.kernel.org;
	dkim=pass (2048-bit key) header.d=kernel.org header.i=@kernel.org header.b="eJUC0Y4C"
X-Original-To: linux-pm@vger.kernel.org
Received: from smtp.kernel.org (aws-us-west-2-korg-mail-1.web.codeaurora.org [10.30.226.201])
	(using TLSv1.2 with cipher ECDHE-RSA-AES256-GCM-SHA384 (256/256 bits))
	(No client certificate requested)
	by smtp.subspace.kernel.org (Postfix) with ESMTPS id A09F52BDC1C;
	Thu, 12 Feb 2026 12:23:29 +0000 (UTC)

>>    (memory size x disk space x workload usage). It is even more
>>    complicated when we take into account the variance of memory
>>    compression, which changes the reclaim dynamics (and as a result,
>>    swap space size requirement). The problem is further exarcebated for
>>    users who rely on swap utilization (and exhaustion) as an OOM signal.
>>
>>    All of these factors make it very difficult to configure the swapfile
>>    for zswap: too small of a swapfile and we risk preventable OOMs and
>>    limit the memory saving potentials of zswap; too big of a swapfile
>>    and we waste disk space and memory due to swap metadata overhead.
>>    This dilemma becomes more drastic in high memory systems, which can
>>    have up to TBs worth of memory.
>>
>> Past attempts to decouple disk and compressed swap backends, namely the
>> ghost swapfile approach (see [13]), as well as the alternative
>> compressed swap backend zram, have mainly focused on eliminating the
>> disk space usage of compressed backends. We want a solution that not
>> only tackles that same problem, but also achieve the dyamicization of
>> swap space to maximize the memory saving potentials while reducing
>> operational and static memory overhead.
>>
>> Finally, any swap redesign should support efficient backend transfer,
>> i.e without having to perform the expensive page table walk to
>> update all the PTEs that refer to the swap entry:
>> * The main motivation for this requirement is zswap writeback. To quote
>>    Johannes (from [14]): "Combining compression with disk swap is
>>    extremely powerful, because it dramatically reduces the worst aspects
>>    of both: it reduces the memory footprint of compression by shedding
>>    the coldest data to disk; it reduces the IO latencies and flash wear
>>    of disk swap through the writeback cache. In practice, this reduces
>>    *average event rates of the entire reclaim/paging/IO stack*."
>> * Another motivation is to simplify swapoff, which is both complicated
>>    and expensive in the current design, precisely because we are storing
>>    an encoding of the backend positional information in the page table,
>>    and thus requires a full page table walk to remove these references.
>>
>>
>> II. High Level Design Overview
>>
>> To fix the aforementioned issues, we need an abstraction that separates
>> a swap entry from its physical backing storage. IOW, we need to
>> “virtualize” the swap space: swap clients will work with a dynamically
>> allocated virtual swap slot, storing it in page table entries, and
>> using it to index into various swap-related data structures. The
>> backing storage is decoupled from the virtual swap slot, and the newly
>> introduced layer will “resolve” the virtual swap slot to the actual
>> storage. This layer also manages other metadata of the swap entry, such
>> as its lifetime information (swap count), via a dynamically allocated,
>> per-swap-entry descriptor:
>>
>> struct swp_desc {
>>          union {
>>                  swp_slot_t         slot;                 /*     0     8 */
>>                  struct zswap_entry * zswap_entry;        /*     0     8 */
>>          };                                               /*     0     8 */
>>          union {
>>                  struct folio *     swap_cache;           /*     8     8 */
>>                  void *             shadow;               /*     8     8 */
>>          };                                               /*     8     8 */
>>          unsigned int               swap_count;           /*    16     4 */
>>          unsigned short             memcgid:16;           /*    20: 0  2 */
>>          bool                       in_swapcache:1;       /*    22: 0  1 */
>>
>>          /* Bitfield combined with previous fields */
>>
>>          enum swap_type             type:2;               /*    20:17  4 */
>>
>>          /* size: 24, cachelines: 1, members: 6 */
>>          /* bit_padding: 13 bits */
>>          /* last cacheline: 24 bytes */
>> };
>>
>> (output from pahole).
>>
>> This design allows us to:
>> * Decouple zswap (and zeromapped swap entry) from backing swapfile:
>>    simply associate the virtual swap slot with one of the supported
>>    backends: a zswap entry, a zero-filled swap page, a slot on the
>>    swapfile, or an in-memory page.
>> * Simplify and optimize swapoff: we only have to fault the page in and
>>    have the virtual swap slot points to the page instead of the on-disk
>>    physical swap slot. No need to perform any page table walking.
>>
>> The size of the virtual swap descriptor is 24 bytes. Note that this is
>> not all "new" overhead, as the swap descriptor will replace:
>> * the swap_cgroup arrays (one per swap type) in the old design, which
>>    is a massive source of static memory overhead. With the new design,
